wrk2/baseline/1024KB/wrk-eth3-rep01.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 688.943ms, rate sampling interval: 1644ms
  Thread calibration: mean lat.: 696.857ms, rate sampling interval: 1658ms
  Thread calibration: mean lat.: 715.565ms, rate sampling interval: 1640ms
  Thread calibration: mean lat.: 699.404ms, rate sampling interval: 1654ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   711.53ms  148.73ms 876.54ms   90.02%
    Req/Sec    16.10      2.57    27.00     85.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  753.15ms
 75.000%  795.14ms
 90.000%  823.81ms
 99.000%  858.62ms
 99.900%  873.98ms
 99.990%  877.05ms
 99.999%  877.05ms
100.000%  877.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      18.127     0.000000            1         1.00
     579.071     0.100000          131         1.11
     662.527     0.200000          262         1.25
     700.927     0.300000          394         1.43
     728.575     0.400000          521         1.67
     753.151     0.500000          655         2.00
     762.879     0.550000          717         2.22
     771.583     0.600000          784         2.50
     778.751     0.650000          851         2.86
     786.431     0.700000          915         3.33
     795.135     0.750000          978         4.00
     798.719     0.775000         1010         4.44
     803.327     0.800000         1045         5.00
     807.423     0.825000         1076         5.71
     812.031     0.850000         1109         6.67
     817.151     0.875000         1142         8.00
     820.735     0.887500         1157         8.89
     823.807     0.900000         1176        10.00
     826.879     0.912500         1193        11.43
     829.439     0.925000         1207        13.33
     834.047     0.937500         1221        16.00
     836.095     0.943750         1231        17.78
     837.631     0.950000         1240        20.00
     841.215     0.956250         1248        22.86
     842.751     0.962500         1256        26.67
     844.799     0.968750         1263        32.00
     846.335     0.971875         1267        35.56
     846.847     0.975000         1272        40.00
     847.359     0.978125         1275        45.71
     848.383     0.981250         1279        53.33
     849.919     0.984375         1282        64.00
     852.991     0.985938         1284        71.11
     854.015     0.987500         1286        80.00
     857.599     0.989062         1288        91.43
     859.647     0.990625         1290       106.67
     862.207     0.992188         1292       128.00
     862.719     0.992969         1293       142.22
     863.231     0.993750         1294       160.00
     863.743     0.994531         1295       182.86
     865.791     0.995313         1296       213.33
     868.351     0.996094         1297       256.00
     871.423     0.996484         1299       284.44
     871.423     0.996875         1299       320.00
     871.423     0.997266         1299       365.71
     871.423     0.997656         1299       426.67
     873.471     0.998047         1300       512.00
     873.471     0.998242         1300       568.89
     873.471     0.998437         1300       640.00
     873.983     0.998633         1301       731.43
     873.983     0.998828         1301       853.33
     873.983     0.999023         1301      1024.00
     873.983     0.999121         1301      1137.78
     873.983     0.999219         1301      1280.00
     877.055     0.999316         1302      1462.86
     877.055     1.000000         1302          inf
#[Mean    =      711.530, StdDeviation   =      148.728]
#[Max     =      876.544, Total count    =         1302]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2002 requests in 30.13s, 1.98GB read
Requests/sec:     66.45
Transfer/sec:     67.38MB