wrk2/baseline/1024KB/wrk-eth3-rep03.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 205.320ms, rate sampling interval: 459ms
  Thread calibration: mean lat.: 505.918ms, rate sampling interval: 1207ms
  Thread calibration: mean lat.: 501.250ms, rate sampling interval: 1185ms
  Thread calibration: mean lat.: 490.379ms, rate sampling interval: 1205ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   423.58ms  168.94ms 649.73ms   59.86%
    Req/Sec    16.95     17.59    54.00     84.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  495.10ms
 75.000%  562.17ms
 90.000%  592.38ms
 99.000%  633.85ms
 99.900%  649.22ms
 99.990%  650.24ms
 99.999%  650.24ms
100.000%  650.24ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      25.983     0.000000            1         1.00
     192.511     0.100000          134         1.11
     214.911     0.200000          267         1.25
     241.919     0.300000          399         1.43
     450.303     0.400000          532         1.67
     495.103     0.500000          664         2.00
     513.023     0.550000          732         2.22
     527.359     0.600000          799         2.50
     541.183     0.650000          868         2.86
     552.447     0.700000          931         3.33
     562.175     0.750000         1001         4.00
     567.295     0.775000         1034         4.44
     571.391     0.800000         1065         5.00
     577.535     0.825000         1097         5.71
     582.143     0.850000         1133         6.67
     587.263     0.875000         1163         8.00
     589.311     0.887500         1179         8.89
     592.383     0.900000         1196        10.00
     595.967     0.912500         1212        11.43
     599.551     0.925000         1230        13.33
     604.159     0.937500         1245        16.00
     605.695     0.943750         1255        17.78
     608.255     0.950000         1263        20.00
     610.303     0.956250         1271        22.86
     613.887     0.962500         1279        26.67
     620.031     0.968750         1287        32.00
     621.055     0.971875         1292        35.56
     622.591     0.975000         1295        40.00
     623.615     0.978125         1299        45.71
     625.663     0.981250         1304        53.33
     628.735     0.984375         1309        64.00
     630.271     0.985938         1310        71.11
     631.295     0.987500         1312        80.00
     633.343     0.989062         1314        91.43
     635.391     0.990625         1316       106.67
     636.415     0.992188         1318       128.00
     637.439     0.992969         1319       142.22
     639.999     0.993750         1320       160.00
     641.535     0.994531         1321       182.86
     642.047     0.995313         1322       213.33
     642.559     0.996094         1323       256.00
     643.583     0.996484         1324       284.44
     643.583     0.996875         1324       320.00
     644.095     0.997266         1325       365.71
     644.095     0.997656         1325       426.67
     648.703     0.998047         1326       512.00
     648.703     0.998242         1326       568.89
     648.703     0.998437         1326       640.00
     649.215     0.998633         1327       731.43
     649.215     0.998828         1327       853.33
     649.215     0.999023         1327      1024.00
     649.215     0.999121         1327      1137.78
     649.215     0.999219         1327      1280.00
     650.239     0.999316         1328      1462.86
     650.239     1.000000         1328          inf
#[Mean    =      423.576, StdDeviation   =      168.945]
#[Max     =      649.728, Total count    =         1328]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2003 requests in 30.13s, 1.98GB read
Requests/sec:     66.48
Transfer/sec:     67.38MB